cask_args appdir: "/Applications"

tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "fzf"
brew "htop"
brew "jq"
brew "mas"
brew "ranger"
brew "tmux"
brew "uv"
brew "gromgit/fuse/sshfs-mac"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", link: false
cask "discord"
cask "font-hackgen"
cask "iterm2"
cask "macfuse"
cask "microsoft-edge"
cask "notion"
cask "notion-calendar"
cask "obs"
cask "obsidian"
cask "stats"
cask "vlc"
cask "zotero"
mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Numbers", id: 409203825
mas "Slack", id: 803453959
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "alpha4.jsonl"
vscode "batisteo.vscode-django"
vscode "battlebas.kivy-vscode"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "cstrap.python-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "foxundermoon.shell-format"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "grapecity.gc-excelviewer"
vscode "himanoa.python-autopep8"
vscode "hollowtree.vue-snippets"
vscode "ionutvmi.path-autocomplete"
vscode "janisdd.vscode-edit-csv"
vscode "jdinhlife.gruvbox"
vscode "jgclark.vscode-todo-highlight"
vscode "jithurjacob.nbpreviewer"
vscode "junkuizhang.sl-rust"
vscode "kevinrose.vsc-python-indent"
vscode "kurusugawa-computer.markdown-copilot"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "meezilla.json"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "njpwerner.autodocstring"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "phplasma.csv-to-table"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "thebarkman.vscode-djaneiro"
vscode "timonwong.shellcheck"
vscode "toba.vsfire"
vscode "trond-snekvik.simple-rst"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "zainchen.json"
vscode "ziyasal.vscode-open-in-github"
